{ "experience":
  [
    {
      "title": "Software Engineer",
      "company": "Qlik",
      "time": "Jan 2016 - current",
      "description": "My role at Qlik is to develop, deploy and thoroughly test performance measurement software. With our team being involved in the very earliest planning of new product features, we always try to stay one step ahead of every potential problem.\nMy role is a unique combination of computer science, software development and people skills. Some of my work consists of facilitating different locations to align with the overall company goals, as well as helping customers realize their goals.\nIn a dynamic and forward-looking environment, I have the good fortune of getting to work with a mix of well established and new technologies, such as Golang, .NET/C#, Kubernetes, Angular, Groovy and Python."
     },
    {
      "title": "Sales Representative",
      "company": "Länsförsäkringar",
      "time": "Jan 2012 - Jan 2016",
      "description": "Proactive insurance brokerage and customer service. I took charge of my own development, and managed to translate this drive into improving sales results over time in an independent and competitive work environment. My role at Länsförsäkringar was very rewarding in allowing to socially engage with customers."
    },
    {
      "title": "Master Thesis Student",
      "company": "Scania",
      "time": "Sep 2015 - Dec 2015",
      "description": "Invented a novel algorithm for predicting the route in a self-learning map system to predict the upcoming road topography and using this data for intelligent cruise control that saves fuel. Built on the in-house expertise at Scania through close cooperation with my supervisor and previous thesis authors. I used Matlab to visualize and evaluate strategies and algorithms and made a prototype in Python to facilitate experimentation."
    },
    {
      "title": "Summer Intern",
      "company": "Axis Communications",
      "time": "Jun 2015 - Aug 2015",
      "description": "Developed tools (Python, C++) to enable the production of full-spectrum (invisible IR light, not just RGB) scenes, and integrated this with an optics simulation pipeline. Ported a Matlab-based camera sensor simulator to Python and SciPy and optimized performance with a factor of 100 over the original implementation."
    },
    {
      "title": "Summer Intern",
      "company": "Scania",
      "time": "Jun 2015 - Aug 2015",
      "description": "Developed an automatic ODX document generation tool (in .NET/C#) that takes raw database data as input. This replaced the previously manual process of producing automotive ECU signal specifications and speeds up the regular release process for ECU software at Scania."
    }
  ]
}